In [5]:
try:
    file = open('pandas.csv','w')

    file.close()
except:
    print("The file is already there.!!")

In [39]:

import pandas as pd

f= pd.read_csv('pandas.csv')
f

   SN      NAME  AGE      ADDRESS  PHONE NUMBER
0   1      ERIC   13   SANTINAGAR    9823554578
1   2      IMAN   14     KOTESWOR   98765435878
2   3   SUSHANT   15    BALKUMARI    9887654522
3   4  SAMARPAN   16    BANESHWOR    9881736333
4   5    BHARAT   14      BARDIYA     987652622
5   6     ARPAN   13    PEPSICOLA    9887162622
6   7   RIGHBED   15  BUDDHANAGAR    9817227374

In [41]:
f.iloc[1:3,0:5]

   SN     NAME  AGE    ADDRESS  PHONE NUMBER
1   2     IMAN   14   KOTESWOR   98765435878
2   3  SUSHANT   15  BALKUMARI    9887654522

In [21]:
import csv
file=open('pandas.csv','r')
p= file.read()
f="A"
if f in p:
    print(p)
    x=p.count(f)
    print(x)
else:
    print("no")

SN,NAME,AGE,ADDRESS,PHONE NUMBER
1,ERIC,13,SANTINAGAR,9823554578
2,IMAN,14,KOTESWOR,98765435878
3,SUSHANT,15,BALKUMARI,9887654522
4,SAMARPAN,16,BANESHWOR,9881736333
5,BHARAT,14,BARDIYA,987652622
6,ARPAN,13,PEPSICOLA,9887162622
7,RIGHBED,15,BUDDHANAGAR,9817227374
24

In [4]:
p.iloc[3:5,1:5]

AttributeError: 'str' object has no attribute 'iloc'

In [24]:
df.tail(4)

   SN      NAME  AGE      ADDRESS  PHONE NUMBER
3   4  SAMARPAN   16    BANESHWOR    9881736333
4   5    BHARAT   14      BARDIYA     987652622
5   6     ARPAN   13    PEPSICOLA    9887162622
6   7   RIGHBED   15  BUDDHANAGAR    9817227374

In [25]:
df.head(2)

   SN  NAME  AGE     ADDRESS  PHONE NUMBER
0   1  ERIC   13  SANTINAGAR    9823554578
1   2  IMAN   14    KOTESWOR   98765435878

In [29]:
import pandas as pd
x=pd.read_csv('pandas.csv',index_col='SN',usecols=['SN','NAME','PHONE NUMBER'])
x

        NAME  PHONE NUMBER
SN
1       ERIC    9823554578
2       IMAN   98765435878
3    SUSHANT    9887654522
4   SAMARPAN    9881736333
5     BHARAT     987652622
6      ARPAN    9887162622
7    RIGHBED    9817227374

In [32]:
d=x.head(6)
y=d.tail(2)
y

      NAME  PHONE NUMBER
SN
5   BHARAT     987652622
6    ARPAN    9887162622

AttributeError: 'str' object has no attribute 'iloc'

In [57]:
import pandas as pd

f= pd.read_csv('pandas.csv')
f[f['ADDRESS']=='SANTINAGAR']

   SN  NAME  AGE     ADDRESS  PHONE NUMBER
0   1  ERIC   13  SANTINAGAR    9823554578

In [87]:
import pandas as pd
x=pd.read_csv('pandas.csv',usecols=['SN','AGE','NAME','PHONE NUMBER'],index_col='SN')
x.iloc[0:5,0:2]

        NAME  AGE
SN
1       ERIC   13
2       IMAN   14
3    SUSHANT   15
4   SAMARPAN   16
5     BHARAT   14

In [33]:
import pandas as pd
x=pd.read_csv('pandas.csv',index_col='NAME')
x.loc['ERIC':'SUSHANT']

         SN  AGE     ADDRESS  PHONE NUMBER
NAME
ERIC      1   13  SANTINAGAR    9823554578
IMAN      2   14    KOTESWOR   98765435878
SUSHANT   3   15   BALKUMARI    9887654522

In [71]:
import pandas as pd
d=pd.read_csv('pandas.csv',index_col='SN')
d[(d['AGE']==13) & (d['NAME']=="ERIC") ]

    NAME  AGE     ADDRESS  PHONE NUMBER
SN
1   ERIC   13  SANTINAGAR    9823554578

In [72]:
import pandas as pd
d=pd.read_csv('pandas.csv',index_col='SN')
d['NAME']=="ARPAN"

SN
1    False
2    False
3    False
4    False
5    False
6     True
7    False
Name: NAME, dtype: bool

In [5]:
import pandas as x
file=x.read_csv('pandas.csv',index_col=='NAME')
file[(file['SN']==1) & (file['SN']==5)]

NameError: name 'index_col' is not defined

In [13]:
import pandas as pd
data= {'name':['ADITYA', 'ERIC', 'AYUSH', 'IMAN', 'SUSHANT', 'SAMARPAN'],
      'age':[13, 14, 16, 16, 14, 15],
      'address':['SANTINAGR','SANTINAGR','SANTINAGR','SANTINAGR','SANTINAGR','SANTINAGR']}

df= pd.DataFrame(data)

df.to_csv('darta.csv')
df

       name  age    address
0    ADITYA   13  SANTINAGR
1      ERIC   14  SANTINAGR
2     AYUSH   16  SANTINAGR
3      IMAN   16  SANTINAGR
4   SUSHANT   14  SANTINAGR
5  SAMARPAN   15  SANTINAGR

In [79]:
df=pd.read_csv('darta.csv', index_col='AGE')
df.drop([14], axis=0)

     NAME    ADDRESS
AGE
15   iman  KATHMANDU

In [1]:
import csv
data=['sn','sabin',53,'Kathmandu']
file= open('darta.csv','w')
x=csv.writer(file)
x.writerow(data)
file.close()

In [22]:
import csv
data=[[1,'sabin',56,'Kathamndu'],
     [2,'babin',45,'biratnagar'],
     [3,'eric',13,'pokhara']]
file= open('darta.csv','w')
x= csv.writer(file)
for i in data:
    x.writerow(i)
file.close()

In [52]:
import csv
csv_columns=['NAME','AGE','ADDRESS']
dict=[{'NAME':'ERIC','AGE':14,'ADDRESS':'KATHMANDU'},
     {'NAME':'iman','AGE':15,'ADDRESS':'KATHMANDU'}]
csvfile= open('darta.csv','w')
writer=csv.DictWriter(csvfile, fieldnames=csv_columns)
writer.writeheader()
for data in dict:
    writer.writerow(data)
file.close()

In [54]:
import csv
with open('darta.csv') as csvfile:
    csv_columns=['NAME','AGE','ADDRESS']
    reader= csv.DictReader(csvfile)
    for row in reader:
        print(row)
file.close()

{'NAME': 'ERIC', 'AGE': '14', 'ADDRESS': 'KATHMANDU'}
{'NAME': 'iman', 'AGE': '15', 'ADDRESS': 'KATHMANDU'}